In [2]:
import pandas as pd
from pandas import DataFrame
from typing import List,Mapping

In [3]:
dict1 = {
    "name": ['harry', 'rohan', 'skillf', 'shubh'],
    "marks": [92, 34, 24, 17],
    "city": ['rampur', 'kolkata', 'barailly', 'antarctica']
}

df = DataFrame(dict1)
df

     name  marks        city
0   harry     92      rampur
1   rohan     34     kolkata
2  skillf     24    barailly
3   shubh     17  antarctica

In [6]:
def check(df:DataFrame, idx: int)-> List[Mapping]:
    #print (df)
    print(df['marks'])
    errors = ([
                dict(Hava="Udo", kitna="lekin")
            ] 
    if idx%2==0
    else []
    )
    
    return errors

finaldf = DataFrame([
    e
    for idx in range(0, 4)
    for e in check(df.loc[idx], idx)
])

92
34
24
17

In [7]:
finaldf

  Hava  kitna
0  Udo  lekin
1  Udo  lekin